In [1]:
import pandas as pd

In [2]:
a = [1,2,3,4,5,6,7]

In [5]:
d = pd.DataFrame(a,columns=['test'])

In [7]:
# How do you create a DataFrame in pandas?
data = {
    'Name': ['John', 'Alice', 'Bob'],
    'Age': [25, 30, 22],
    'City': ['New York', 'Paris', 'London']
}

In [8]:
pd.DataFrame(data)

    Name  Age      City
0   John   25  New York
1  Alice   30     Paris
2    Bob   22    London